In [2]:
import numpy as np
import pandas as pd
import env
from env import get_db_url

url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/{env.database}'

In [3]:
# Once you have successfully run a query:

from sqlalchemy import text, create_engine

engine = create_engine(url)

query = text('SELECT * FROM employees LIMIT 5 OFFSET 50')

pd.read_sql(query, engine.connect())

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [4]:
# a. Intentionally make a typo in the database url. What kind of error message do you see? 

print(f'Typo in database URL created an Attribute Error')

Typo in database URL created an Attribute Error

In [5]:
# b. Intentionally make an error in your SQL query. What does the error message look like?

print(f'Error in SQL Query looks like programming error database/table non existent')

Error in SQL Query looks like programming error database/table non existent

In [6]:
# Read the employees and titles tables into two separate DataFrames.
print(f'employees dataframe')

employees_df = pd.read_sql("SELECT * FROM employees", engine)

employees_df.shape

employees dataframe

(300024, 6)

In [7]:
print(f'Titles dataframe')
titles_df = pd.read_sql("SELECT * FROM titles", engine)

titles_df.shape

Titles dataframe

(443308, 4)

In [8]:
# How many rows and columns do you have in each DataFrame? Is that what you expected?
employees_rows, employees_columns = employees_df.shape
titles_rows, titles_columns = titles_df.shape

print(f'there are {employees_rows} rows and {employees_columns} columns in the employees df')
print(f'there are {titles_rows} rows and {titles_columns} columns in the employees df')

there are 300024 rows and 6 columns in the employees df
there are 443308 rows and 4 columns in the employees df

In [8]:
# Display the summary statistics for each DataFrame.

employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [10]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [11]:
# How many unique titles are in the titles DataFrame?

unique_title_count = titles_df['title'].nunique()
print(f'there are {unique_title_count} unique titles in the titles df')

there are 7 unique titles in the titles df

In [12]:
# What is the oldest date in the to_date column?

oldest_to_date = titles_df['to_date'].min()
print(f'the oldest to date is {oldest_to_date} in the titles df')

the oldest to date is 1985-03-01 in the titles df

In [13]:
# What is the most recent date in the to_date column?

most_recent_to_date = titles_df['to_date'].max()
print(f'the most recent to date in the titles df is {most_recent_to_date}')

the most recent to date in the titles df is 9999-01-01